# St7GetBeamSpringCoils

Returns the number of coils displayed for spring elements.

long St7GetBeamSpringCoils(long uID, long* Coils)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Coils
The number of coils to display in the range kMinSpringCoils to kMaxSpringCoils.